mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/src/ota_delta.c
// MeshCore `.mota` delta-apply for the nRF52 bootloader (single-slot, detools in-place).
// See ota_delta.h for the contract. Compiles for the device (nrfx/SDK) and for a host test harness
// (OTA_DELTA_HOST_TEST: the test TU provides the otah_* flash/settings/gpregret stubs + crc16).
#include "ota_delta.h"
#include "ota_layout.h"
#include "ota_bl_info.h"
#if defined(MOTA_SD_CARD)
  #include "ota_sd_auth.h"
  #include "ota_sd_spi.h"
#endif
#if defined(MOTA_SD_BOOTLOADER_UPDATE)
  #include "ota_sd_boot_token.h"
#endif
#if defined(MOTA_QSPI_FLASH)
  #include "ota_qspi.h"
#endif
#if defined(MOTA_SD_BOOTLOADER_UPDATE) || defined(MOTA_QSPI_BOOTLOADER_UPDATE) || \
  defined(MOTA_INTERNAL_BOOTLOADER_UPDATE)
  #include "usb/uf2/bootloader_image.h"
#endif
#include "detools/detools.h"
#include <stddef.h>
#include <string.h>
#include <stdint.h>

#if defined(OTA_DELTA_HOST_TEST) && !defined(MOTA_SOFTDEVICE_FAMILY)
  #define MOTA_SOFTDEVICE_FAMILY 140u
#endif

#if defined(MOTA_QSPI_BOOTLOADER_UPDATE)
  #define MOTA_QSPI_STORAGE_FLAGS \
    (MOTA_BL_STORAGE_QSPI | MOTA_BL_STORAGE_STAGE_CEILING | MOTA_BL_STORAGE_BOOT_UPDATE)
#else
  #define MOTA_QSPI_STORAGE_FLAGS (MOTA_BL_STORAGE_QSPI | MOTA_BL_STORAGE_STAGE_CEILING)
#endif

#if defined(MOTA_SD_BOOTLOADER_UPDATE)
  #define MOTA_SD_STORAGE_FLAGS (MOTA_BL_STORAGE_SD | MOTA_BL_STORAGE_BOOT_UPDATE)
#else
  #define MOTA_SD_STORAGE_FLAGS MOTA_BL_STORAGE_SD
#endif

#if defined(MOTA_SD_BOOTLOADER_UPDATE) || defined(MOTA_QSPI_BOOTLOADER_UPDATE) || \
  defined(MOTA_INTERNAL_BOOTLOADER_UPDATE)
  #define MOTA_BOOTLOADER_UPDATE_ENABLED 1
#endif

#if defined(MOTA_SD_BOOTLOADER_UPDATE)
  #define MOTA_BOOT_UPDATE_STORAGE_FLAGS MOTA_SD_STORAGE_FLAGS
#elif defined(MOTA_QSPI_BOOTLOADER_UPDATE)
  #define MOTA_BOOT_UPDATE_STORAGE_FLAGS MOTA_QSPI_STORAGE_FLAGS
#elif defined(MOTA_INTERNAL_BOOTLOADER_UPDATE)
  // No backend bit means the normal internal staging window. GPREGRET 0x6A vs
  // 0x6B selects an application vs bootloader package in that shared window.
  #define MOTA_BOOT_UPDATE_STORAGE_FLAGS (MOTA_BL_STORAGE_STAGE_CEILING | MOTA_BL_STORAGE_BOOT_UPDATE)
#endif

#if defined(MOTA_BOOTLOADER_UPDATE_ENABLED)
  #define MOTA_BOOT_UPDATE_CODEC_MASK ((1u << CODEC_FULL) | (1u << CODEC_INPLACE))
#endif

// Capability marker the running MeshCore app scans for (see ota_bl_info.h). `used` + the reference in
// ota_delta_check_and_apply() keep it through -ffunction/data-sections, --gc-sections and -flto.
__attribute__((used, aligned(4))) const mota_bl_info_t g_mota_bl_info = {
  {MOTA_BL_MAGIC0, MOTA_BL_MAGIC1, MOTA_BL_MAGIC2, MOTA_BL_MAGIC3, MOTA_BL_MAGIC4, MOTA_BL_MAGIC5, MOTA_BL_MAGIC6,
   MOTA_BL_MAGIC7},
  MOTA_BL_APPLY_ABI,
#if defined(MOTA_SD_CARD)
  (uint16_t)((1u << 0) | (1u << 2)), // SD: full images and in-place deltas
  {MOTA_SD_STORAGE_FLAGS, 0, 0, 0},  // retained-auth SD source
#elif defined(MOTA_QSPI_FLASH)
  (uint16_t)((1u << 0) | (1u << 2)), // QSPI: full images and in-place deltas
  {MOTA_QSPI_STORAGE_FLAGS, 0, 0, 0},
#elif defined(MOTA_INTERNAL_BOOTLOADER_UPDATE)
  (uint16_t)((1u << 0) | (1u << 2)), // internal staging: bootloader full image + app in-place delta
  {MOTA_BOOT_UPDATE_STORAGE_FLAGS, 0, 0, 0},
#else
  (uint16_t)(1u << 2), // internal flash: in-place deltas only
  {MOTA_BL_STORAGE_STAGE_CEILING, 0, 0, 0}, // GPREGRET2 selects the safe staging ceiling
#endif
};

// ---- `.mota` / EndF on-wire constants (mirror of src/helpers/ota/OtaFormat.h, C-friendly) ---------
static const uint8_t MAGIC[4]   = {'m', 'O', 'T', 'A'};
static const uint8_t TRAILER[5] = {'v', 'k', '4', '9', '6'};
static const uint8_t ENDF[4]    = {'E', 'n', 'd', 'F'};
static const uint8_t APRV[4]    = {'A', 'P', 'R', 'V'};
#define ENDF_LEN   56u  // fixed trailer: marker(4)+body_len(4)+body_hash8(8)+fw_ver(4)+target(4)+hw_id(32)
#define MOTA_MFL   197u // fixed manifest-minus-leaves length (head 89 + base_hash 8 + signer 32 + sig 64 + approval 4)
#define MFLAG_FULL 0x01u
#define MFLAG_SIGNED  0x02u
#define MFLAG_BOOTLOADER 0x04u
#define CODEC_FULL    0u
#define CODEC_INPLACE 2u
#define PAGE          MOTA_NRF52_FLASH_PAGE

// ---- platform flash / settings / gpregret abstraction --------------------------------------------
#ifdef OTA_DELTA_HOST_TEST
extern void     otah_read(uint32_t addr, void *dst, uint32_t n);
extern void     otah_erase(uint32_t page_addr);
extern void     otah_write_words(uint32_t addr, const uint32_t *src, uint32_t nwords);
extern uint32_t otah_gpregret_get(void);
extern void     otah_gpregret_set(uint32_t v);
extern uint32_t otah_gpregret2_get(void);
extern void     otah_gpregret2_set(uint32_t v);
extern uint16_t otah_crc16(uint32_t addr, uint32_t len);
extern void     otah_settings_commit(uint16_t bank0, uint16_t crc, uint32_t size);
#if defined(MOTA_SD_CARD)
extern void     otah_sd_auth_read(void *dst, uint32_t len);
extern void     otah_sd_auth_consume(void);
#endif
#if defined(MOTA_INTERNAL_BOOTLOADER_UPDATE) || defined(MOTA_SD_BOOTLOADER_UPDATE)
extern int      otah_crc_bound_app_size(uint32_t *size);
#endif
#if defined(MOTA_BOOTLOADER_UPDATE_ENABLED)
extern int      otah_installed_boot_info(bootloader_image_info_t *info);
extern uint16_t otah_runtime_softdevice_fwid(void);
#endif
  #define APP_BASE MOTA_NRF52_APP_BASE
static void fl_read(uint32_t a, void *d, uint32_t n) {
  otah_read(a, d, n);
}
static void fl_erase(uint32_t page) {
  otah_erase(page);
}
static void fl_write_words(uint32_t a, const uint32_t *s, uint32_t nw) {
  otah_write_words(a, s, nw);
}
static uint32_t gpregret_get(void) {
  return otah_gpregret_get();
}
static void gpregret_set(uint32_t v) {
  otah_gpregret_set(v);
}
static uint32_t gpregret2_get(void) {
  return otah_gpregret2_get();
}
static void gpregret2_set(uint32_t v) {
  otah_gpregret2_set(v);
}
static uint16_t crc16_region(uint32_t a, uint32_t len) {
  return otah_crc16(a, len);
}
#else
  #include "nrf.h"
  #include "nrfx_nvmc.h"
  #include "crc16.h"
  #include "boards.h"
  #include "bootloader_types.h"
  #include "bootloader_settings.h"
  #include "bootloader_settings_guard.h"
  #include "dfu_types.h"
  #if defined(MOTA_BOOTLOADER_UPDATE_ENABLED)
    #include "usb/uf2/uf2cfg.h"
    #include "nrf_mbr.h"
    #include "nrf_sdm.h"
    #include "ota_softdevice_fwid.h"
  #endif
  #define APP_BASE           ((uint32_t)DFU_BANK_0_REGION_START)
// Read flash through a VOLATILE pointer. In-place apply WRITES flash (nrfx_nvmc_words_write) and then
// READS IT BACK here (decode readback + the post-apply sha256). Those touch the same flash through two
// different pointer provenances (an integer-cast read pointer vs the nrfx write), so whole-program -flto
// alias analysis concludes they can't alias and caches/reorders a STALE read - the post-check then hashes
// pre-decode bytes -> mismatch -> apply silently refused. (-fno-strict-aliasing does NOT help: this is
// provenance, not type-based aliasing.) The host harness can't reproduce it: there read+write hit the
// same C array, an obvious alias. volatile forces the actual load each time.
static void fl_read(uint32_t a, void *d, uint32_t n) {
  const volatile uint8_t *s = (const volatile uint8_t *)(uintptr_t)a;
  uint8_t                *o = (uint8_t *)d;
  for (uint32_t i = 0; i < n; i++) {
    o[i] = s[i];
  }
}
static void fl_erase(uint32_t page) {
  nrfx_nvmc_page_erase(page);
}
static void fl_write_words(uint32_t a, const uint32_t *s, uint32_t nw) {
  nrfx_nvmc_words_write(a, s, nw);
}
static uint32_t gpregret_get(void) {
  return NRF_POWER->GPREGRET;
}
static void gpregret_set(uint32_t v) {
  NRF_POWER->GPREGRET = v;
}
// Diagnostic: stash an apply bail/progress code in GPREGRET2 (retained across the boot to the app, which
// reads it back). SD is off in the bootloader, so a direct write is fine.
static uint32_t gpregret2_get(void) {
  return NRF_POWER->GPREGRET2;
}
static void gpregret2_set(uint32_t v) {
  NRF_POWER->GPREGRET2 = v;
}
static uint16_t crc16_region(uint32_t a, uint32_t len) {
  return crc16_compute((const uint8_t *)(uintptr_t)a, len, NULL);
}
static void otah_settings_commit(uint16_t bank0, uint16_t crc, uint32_t size) {
  bootloader_settings_t s;
  memset(&s, 0, sizeof(s));
  s.bank_0      = bank0;
  s.bank_0_crc  = crc;
  s.bank_0_size = size;
  s.bank_1      = BANK_INVALID_APP;
  bootloader_settings_seal(&s);

  const uint32_t *words = (const uint32_t *)&s;
  nrfx_nvmc_page_erase(BOOTLOADER_SETTINGS_ADDRESS);
  nrfx_nvmc_words_write(BOOTLOADER_SETTINGS_ADDRESS + 2u * sizeof(uint32_t),
                        &words[2], sizeof(s) / sizeof(uint32_t) - 2u);
  nrfx_nvmc_word_write(BOOTLOADER_SETTINGS_ADDRESS + sizeof(uint32_t), words[1]);
  nrfx_nvmc_word_write(BOOTLOADER_SETTINGS_ADDRESS, words[0]);
}
  #define BANK_VALID_APP_V   0x01u
  #define BANK_INVALID_APP_V 0xFFu
#endif

#if (defined(MOTA_SD_BOOTLOADER_UPDATE) && defined(MOTA_QSPI_BOOTLOADER_UPDATE)) || \
  (defined(MOTA_SD_BOOTLOADER_UPDATE) && defined(MOTA_INTERNAL_BOOTLOADER_UPDATE)) || \
  (defined(MOTA_QSPI_BOOTLOADER_UPDATE) && defined(MOTA_INTERNAL_BOOTLOADER_UPDATE))
  #error "Select exactly one bootloader-update staging backend"
#endif

#if defined(MOTA_BOOTLOADER_UPDATE_ENABLED)
  #if !defined(USB_DESC_VID) || !defined(USB_DESC_UF2_PID) || !defined(DEVICE_NAME)
    #error "Bootloader update requires USB_DESC_VID, USB_DESC_UF2_PID, and DEVICE_NAME identity"
  #endif
  #if !defined(OTA_DELTA_HOST_TEST) && !defined(NRF52840_XXAA)
    #error "App-preserving bootloader update requires the nRF52840 1 MiB flash layout"
  #endif
  #define BOOT_UPDATE_BOARD_ID (((uint32_t)USB_DESC_VID << 16) | USB_DESC_UF2_PID)
  #if defined(MOTA_INTERNAL_BOOTLOADER_UPDATE) || defined(MOTA_SD_BOOTLOADER_UPDATE)
    #define APP_APPLY_END MOTA_NRF52_APP_END
  #else
    #define APP_APPLY_END MOTA_NRF52_BL_SCRATCH_START
  #endif
#endif

#if defined(MOTA_SD_BOOTLOADER_UPDATE)
  #if !defined(MOTA_SD_CARD)
    #error "MOTA_SD_BOOTLOADER_UPDATE requires MOTA_SD_CARD"
  #endif
#elif defined(MOTA_QSPI_BOOTLOADER_UPDATE)
  #if !defined(MOTA_QSPI_FLASH)
    #error "MOTA_QSPI_BOOTLOADER_UPDATE requires MOTA_QSPI_FLASH"
  #endif
  #if !defined(USB_DESC_VID) || USB_DESC_VID != 0x2886 || \
    (!defined(USB_DESC_UF2_PID) || (USB_DESC_UF2_PID != 0x0044 && USB_DESC_UF2_PID != 0x0045))
    #error "MOTA_QSPI_BOOTLOADER_UPDATE is supported only on XIAO nRF52840 / Sense"
  #endif
#elif defined(MOTA_INTERNAL_BOOTLOADER_UPDATE)
  #if defined(MOTA_QSPI_FLASH) || defined(MOTA_SD_CARD)
    #error "MOTA_INTERNAL_BOOTLOADER_UPDATE requires internal-only OTA storage"
  #endif
#else
  #define APP_APPLY_END MOTA_NRF52_APP_END
#endif
#ifdef OTA_DELTA_HOST_TEST
  #define BANK_VALID_APP_V   0x01u
  #define BANK_INVALID_APP_V 0xFFu
#endif

