mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/src/ota_delta.c
#include "sha256.h"

// The application watchdog survives the NVIC reset used to enter this
// bootloader. Normal BLE/USB DFU reloads it from bootloader.c's event loop,
// while the in-place delta applier runs outside that loop. Keep every enabled
// reload channel alive throughout the potentially long scan/hash/apply path.
// A host test has no hardware watchdog, so this becomes a no-op there.
static void inherited_watchdog_feed(void) {
#ifndef OTA_DELTA_HOST_TEST
  static uint8_t external_feed_divider;

  if (NRF_WDT->RUNSTATUS != 0) {
    const uint32_t enabled_channels = NRF_WDT->RREN & 0xFFu;
    for (uint8_t channel = 0; channel < 8; channel++) {
      if ((enabled_channels & (1u << channel)) != 0) {
        NRF_WDT->RR[channel] = WDT_RR_RR_Reload;
      }
    }
  }

  // The external watchdog pulse is deliberately less frequent than the cheap
  // internal reload. Hashing calls this checkpoint every 256 bytes; pulsing on
  // every call would add several seconds to a large update.
  if ((external_feed_divider++ & 0x7FU) == 0) {
    board_watchdog_feed();
  }
#endif
}

static uint32_t rd_u32(const uint8_t *p) {
  return (uint32_t)p[0] | ((uint32_t)p[1] << 8) | ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
}

#if defined(MOTA_BOOTLOADER_UPDATE_ENABLED)
static uint16_t rd_u16(const uint8_t *p) {
  return (uint16_t)p[0] | ((uint16_t)p[1] << 8);
}
#endif

#if defined(MOTA_SD_CARD)
static uint32_t g_sd_first_sector;
static uint32_t g_sd_total_size;
static mota_sd_auth_t g_sd_auth;
static int g_sd_auth_loaded;

// Copy the retained authorization into bootloader-owned RAM and consume it
// before the first access to removable media.  Thus every trigger is one-shot,
// including invalid records and SD failures.  A reset/power cut cannot retry.
static int sd_auth_take(uint8_t purpose, uint8_t format_ver) {
#ifdef OTA_DELTA_HOST_TEST
  otah_sd_auth_read(&g_sd_auth, sizeof(g_sd_auth));
  otah_sd_auth_consume();
#else
  const volatile uint8_t *src =
    (const volatile uint8_t *)(uintptr_t)MOTA_SD_AUTH_ADDRESS;
  uint8_t *dst = (uint8_t *)&g_sd_auth;
  for (uint32_t i = 0; i < sizeof(g_sd_auth); i++) {
    dst[i] = src[i];
  }
  volatile uint32_t *words =
    (volatile uint32_t *)(uintptr_t)MOTA_SD_AUTH_ADDRESS;
  for (uint32_t i = 0; i < sizeof(g_sd_auth) / sizeof(uint32_t); i++) {
    words[i] = 0u;
  }
  __DMB();
  __DSB();
#endif
  g_sd_auth_loaded = mota_sd_auth_valid(&g_sd_auth, purpose, format_ver);
  return g_sd_auth_loaded;
}

// In an SD build, patch/container offsets are relative to the first sector
// named by the consumed retained-RAM authorization. Internal-flash builds
// continue to use absolute flash addresses, preserving the existing path.
static int staged_read(uint32_t address_or_offset, void *dst, uint32_t len) {
  if (address_or_offset > g_sd_total_size ||
      len > g_sd_total_size - address_or_offset) {
    return 0;
  }
  return ota_sd_read_bytes(g_sd_first_sector, address_or_offset, dst, len) ? 1 : 0;
}
#elif defined(MOTA_QSPI_FLASH)
static uint32_t g_qspi_total_size;
static int      g_qspi_source;

static int staged_read(uint32_t address_or_offset, void *dst, uint32_t len) {
  if (g_qspi_source) {
    if ((uint64_t)address_or_offset + len > g_qspi_total_size) {
      return 0;
    }
    return ota_qspi_read(address_or_offset, dst, len) ? 1 : 0;
  }
  fl_read(address_or_offset, dst, len);
  return 1;
}
#else
static int staged_read(uint32_t address_or_offset, void *dst, uint32_t len) {
  fl_read(address_or_offset, dst, len);
  return 1;
}
#endif

static void sha256_region(uint32_t addr, uint32_t len, uint8_t out[32]) {
  sha256_ctx_t c;
  sha256_init(&c);
  uint8_t buf[256];
  while (len) {
    inherited_watchdog_feed();
    uint32_t n = len < sizeof(buf) ? len : sizeof(buf);
    fl_read(addr, buf, n);
    sha256_update(&c, buf, n);
    addr += n;
    len -= n;
  }
  sha256_final(&c, out);
}

// ---- coherent single-page write-back cache (in-place reads back shifted data it just wrote) -------
static uint8_t  g_cache[PAGE] __attribute__((aligned(4)));
static uint32_t g_cache_page; // page-aligned addr; 0 == INVALID (no app page is at 0)
static int      g_cache_dirty;

static void cache_flush(void) {
  if (!g_cache_page) {
    return;
  }
  if (g_cache_dirty) {
    inherited_watchdog_feed();
    fl_erase(g_cache_page);
    inherited_watchdog_feed();
    fl_write_words(g_cache_page, (const uint32_t *)g_cache, PAGE / 4);
  }
  g_cache_page  = 0;
  g_cache_dirty = 0;
}
static void cache_use(uint32_t page) {
  if (g_cache_page == page) {
    return;
  }
  cache_flush();
  g_cache_page  = page;
  g_cache_dirty = 0;
  fl_read(page, g_cache, PAGE);
}
static void cread(uint32_t addr, uint8_t *dst, uint32_t n) { // coherent read (overlay dirty page)
  fl_read(addr, dst, n);
  if (g_cache_page && g_cache_dirty) {
    uint32_t cs = g_cache_page, ce = g_cache_page + PAGE, a = addr, e = addr + n;
    uint32_t os = a > cs ? a : cs, oe = e < ce ? e : ce;
    if (os < oe) {
      memcpy(dst + (os - a), g_cache + (os - cs), oe - os);
    }
  }
}
static void cwrite(uint32_t addr, const uint8_t *src, uint32_t n) {
  while (n) {
    uint32_t page = addr & ~(PAGE - 1), off = addr - page, chunk = PAGE - off;
    if (chunk > n) {
      chunk = n;
    }
    cache_use(page);
    memcpy(g_cache + off, src, chunk);
    g_cache_dirty = 1;
    addr += chunk;
    src += chunk;
    n -= chunk;
  }
}
static void cerase(uint32_t addr, uint32_t n) { // detools calls this page-aligned
  while (n) {
    uint32_t page = addr & ~(PAGE - 1), off = addr - page, step = PAGE - off;
    if (step > n) {
      step = n;
    }
    if (g_cache_page == page) {
      memset(g_cache, 0xFF, PAGE);
      g_cache_dirty = 1;
    } else {
      fl_erase(page);
    }
    addr += step;
    n -= step;
  }
}

// ---- detools in-place callbacks (region addresses are 0-based; base sits at workspace offset 0) ---
struct apply_ctx {
  uint32_t patch_addr, patch_len, patch_pos;
  uint32_t ws_lo, ws_hi; // workspace = [ws_lo, ws_hi); ws_hi == mota start (never written)
  int      step;
};
static int dt_ws_addr(const struct apply_ctx *c, uintptr_t off, size_t n, uint32_t *addr) {
  uint32_t span = c->ws_hi - c->ws_lo;
  if (off > UINT32_MAX || n > UINT32_MAX) {
    return 0;
  }
  uint32_t o = (uint32_t)off, z = (uint32_t)n;
  if (o > span || z > span - o) {
    return 0;
  }
  *addr = c->ws_lo + o;
  return 1;
}
static int dt_mr(void *a, void *dst, uintptr_t src, size_t n) {
  struct apply_ctx *c = a;
  uint32_t          addr;
  if (!dt_ws_addr(c, src, n, &addr)) {
    return -DETOOLS_IO_FAILED;
  }
  inherited_watchdog_feed();
  cread(addr, dst, n);
  return DETOOLS_OK;
}
static int dt_mw(void *a, uintptr_t dst, void *src, size_t n) {
  struct apply_ctx *c = a;
  uint32_t          addr;
  if (!dt_ws_addr(c, dst, n, &addr)) {
    return -DETOOLS_IO_FAILED;
  }
  inherited_watchdog_feed();
  cwrite(addr, (const uint8_t *)src, n);
  return DETOOLS_OK;
}
static int dt_me(void *a, uintptr_t addr0, size_t n) {
  struct apply_ctx *c = a;
  uint32_t          addr;
  if (!dt_ws_addr(c, addr0, n, &addr)) {
    return -DETOOLS_IO_FAILED;
  }
  inherited_watchdog_feed();
  cerase(addr, n);
  return DETOOLS_OK;
}
static int dt_ss(void *a, int s) {
  ((struct apply_ctx *)a)->step = s;
  return DETOOLS_OK;
}
static int dt_sg(void *a, int *s) {
  *s = ((struct apply_ctx *)a)->step;
  return DETOOLS_OK;
}
static int dt_pr(void *a, uint8_t *dst, size_t n) {
  struct apply_ctx *c = a;
  if (n > UINT32_MAX || c->patch_pos > c->patch_len || (uint32_t)n > c->patch_len - c->patch_pos) {
    return -DETOOLS_IO_FAILED;
  }
  inherited_watchdog_feed();
  if (!staged_read(c->patch_addr + c->patch_pos, dst, (uint32_t)n)) {
    return -DETOOLS_IO_FAILED;
  }
  c->patch_pos += (uint32_t)n;
  return DETOOLS_OK;
}

