mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/src/ota_delta.c
struct mota_min {
  uint32_t total, image_size, payload_size, payload_addr, approval_addr;
  uint32_t target_id, fw_version, block_count;
  uint8_t  base_hash[8], image_hash[32], hw_id[32];
  uint8_t  codec_id, is_full, approved, format_ver, flags, hash_algo, block_size_log2;
};

// The manifest prefix is invariant and byte-oriented. Byte arrays keep every
// multibyte field alignment-safe; rd_u32() performs the little-endian decode.
typedef struct {
  uint8_t magic[4];
  uint8_t total[4];
  uint8_t format_ver;
  uint8_t flags;
  uint8_t hash_algo;
  uint8_t target_id[4];
  uint8_t fw_version[4];
  uint8_t image_size[4];
  uint8_t payload_size[4];
  uint8_t block_size_log2;
  uint8_t merkle_root[4];
  uint8_t image_hash[32];
  uint8_t codec_id;
  uint8_t hw_id[32];
  uint8_t base_hash[8];
  uint8_t signer[32];
  uint8_t signature[64];
  uint8_t approval[4];
} mota_fixed_header_t;

typedef char mota_fixed_header_size_must_match_wire_format
  [(sizeof(mota_fixed_header_t) == 8u + MOTA_MFL) ? 1 : -1];

// Decode the five unsigned sizes in an in-place detools header without starting the decoder. This lets
// us reject impossible flash geometry while the running application and its boot settings are intact.
static int dt_header_u32(uint32_t addr, uint32_t len, uint32_t *pos, uint32_t *out) {
  uint8_t b;
  if (*pos >= len) {
    return 0;
  }
  if (!staged_read(addr + (*pos)++, &b, 1)) {
    return 0;
  }
  uint32_t v     = b & 0x3Fu;
  uint32_t shift = 6;
  while (b & 0x80u) {
    if (*pos >= len) {
      return 0;
    }
    if (!staged_read(addr + (*pos)++, &b, 1)) {
      return 0;
    }
    uint32_t bits = b & 0x7Fu;
    if (shift >= 32 || bits > (UINT32_MAX >> shift)) {
      return 0;
    }
    v |= bits << shift;
    shift += 7;
  }
  if (v > 0x7FFFFFFFu) {
    return 0; // detools stores header sizes in signed int
  }
  *out = v;
  return 1;
}

static int dt_geometry_values_ok(const struct mota_min *m, uint32_t body_len,
                                 uint32_t ws_span, uint8_t fixed,
                                 uint32_t memory, uint32_t segment,
                                 uint32_t shift, uint32_t from, uint32_t to) {
  // PATCH_TYPE_IN_PLACE (high nibble 1) and COMPRESSION_CRLE (low nibble 2).
  if (((fixed >> 4) & 0x07u) != 1u || (fixed & 0x0Fu) != 2u) {
    return 0;
  }
  if (memory == 0 || memory > ws_span || segment != PAGE || shift > memory || shift % segment != 0 ||
      from > memory - shift || to > memory) {
    return 0;
  }
  if (body_len > UINT32_MAX - ENDF_LEN || from != body_len + ENDF_LEN) {
    return 0;
  }
  return to == m->image_size && to <= ws_span;
}

static int dt_geometry_ok(const struct mota_min *m, uint32_t body_len, uint32_t ws_span) {
  uint8_t  fixed;
  uint32_t p = 1, memory, segment, shift, from, to;
  if (m->payload_size < 2 || !staged_read(m->payload_addr, &fixed, 1) ||
      !dt_header_u32(m->payload_addr, m->payload_size, &p, &memory) ||
      !dt_header_u32(m->payload_addr, m->payload_size, &p, &segment) ||
      !dt_header_u32(m->payload_addr, m->payload_size, &p, &shift) ||
      !dt_header_u32(m->payload_addr, m->payload_size, &p, &from) ||
      !dt_header_u32(m->payload_addr, m->payload_size, &p, &to)) {
    return 0;
  }
  return dt_geometry_values_ok(m, body_len, ws_span, fixed, memory, segment,
                               shift, from, to);
}

// ---- `.mota` parse (fixed fields only) + EndF base location --------------------------------------
static int parse_mota_at(uint32_t addr, uint32_t limit, struct mota_min *o) {
  if (addr > limit) {
    return 0;
  }
  uint32_t avail = limit - addr;
  if (avail < sizeof(mota_fixed_header_t) + sizeof(TRAILER)) {
    return 0;
  }

  mota_fixed_header_t header;
  if (!staged_read(addr, &header, sizeof(header)) ||
      memcmp(header.magic, MAGIC, sizeof(header.magic)) != 0) {
    return 0;
  }
  uint32_t const total = rd_u32(header.total);
  if (total < sizeof(header) + sizeof(TRAILER) || total > avail) {
    return 0;
  }
  uint8_t trailer[sizeof(TRAILER)];
  if (!staged_read(addr + total - sizeof(trailer), trailer, sizeof(trailer)) ||
      memcmp(trailer, TRAILER, sizeof(trailer)) != 0) {
    return 0;
  }

  // base_hash, signer, and signature are always present (zero-filled when not
  // applicable), so the fixed header has no optional fields.
  o->format_ver = header.format_ver;
  if (o->format_ver != 2
#if defined(MOTA_BOOTLOADER_UPDATE_ENABLED)
      && o->format_ver != 3
#endif
  ) {
    return 0;
  }
  o->flags           = header.flags;
  o->hash_algo       = header.hash_algo;
  o->target_id       = rd_u32(header.target_id);
  o->fw_version      = rd_u32(header.fw_version);
  o->image_size      = rd_u32(header.image_size);
  o->payload_size    = rd_u32(header.payload_size);
  o->block_size_log2 = header.block_size_log2;
  o->codec_id        = header.codec_id;
  o->is_full         = (o->flags & MFLAG_FULL) ? 1 : 0;
  o->approval_addr   = addr + offsetof(mota_fixed_header_t, approval);
  o->approved = memcmp(header.approval, APRV, sizeof(header.approval)) == 0;
  memcpy(o->image_hash, header.image_hash, sizeof(o->image_hash));
  memcpy(o->hw_id, header.hw_id, sizeof(o->hw_id));
  memcpy(o->base_hash, header.base_hash, sizeof(o->base_hash));

  if (o->block_size_log2 == 0 || o->block_size_log2 > 24 || o->payload_size == 0) {
    return 0;
  }

  // Avoid ceil-addition overflow: quotient plus a nonzero remainder is the
  // exact leaf count. The 16-bit cap then bounds all remaining arithmetic.
  uint32_t const block_size = 1u << o->block_size_log2;
  uint32_t block_count = o->payload_size >> o->block_size_log2;
  if ((o->payload_size & (block_size - 1u)) != 0u) {
    block_count++;
  }
  if (block_count == 0u || block_count > UINT16_MAX) {
    return 0;
  }
  uint32_t const payload_offset = sizeof(header) + block_count * sizeof(uint32_t);
  uint32_t const payload_end = total - sizeof(TRAILER);
  if (payload_offset > payload_end ||
      o->payload_size != payload_end - payload_offset) {
    return 0; // payload must end exactly at the trailer
  }
  o->block_count = block_count;
  o->payload_addr = addr + payload_offset;
  o->total        = total;
  return 1;
}

// Scan page boundaries for a valid `.mota`, returning the HIGHEST one below the selected ceiling.
//
// Direction matters for safety. The app stages the container bottom-aligned and writes [write_start,
// stage_ceiling) contiguously (0xFF-padding the tail), so the *current* `.mota` is always the
// highest in flash; a leftover from a prior, differently-sized fetch sits strictly BELOW it (a larger
// new fetch overwrites everything from its lower start up to the ceiling). Scanning top-down therefore
// returns the current container and never stops on a stale one - and the caller's APRV check is applied
// to THAT (highest) container only, so a stale lower `.mota` is never applied even if it is still
// approved. Exact bottom-alignment also prevents a mismatched ceiling hint from selecting a package.
// (EndF is the mirror image: the app image grows up from APP_BASE, so the current trailer is
// the LOWEST valid marker and find_body_len scans bottom-up. Each marker is scanned from the end where
// the current one is encountered first.)
#define MOTA_MIN_LEN (8 + MOTA_MFL + 5)
static uint32_t scan_mota(struct mota_min *o, uint32_t stage_ceiling) {
#if defined(MOTA_SD_CARD)
  (void)stage_ceiling;
  if (!g_sd_auth_loaded || !ota_sd_init()) {
    return 0;
  }
  const uint32_t first = g_sd_auth.first_sector;
  const uint32_t total = g_sd_auth.container_total;
  if (total < MOTA_MIN_LEN) {
    return 0;
  }
  g_sd_first_sector = first;
  g_sd_total_size   = total;
  if (!parse_mota_at(0, g_sd_total_size, o) || o->total != total) {
    return 0;
  }
  return 1; // nonzero sentinel; container begins at file offset 0
#else
  #if defined(MOTA_QSPI_FLASH)
  if (g_qspi_source) {
    if (!ota_qspi_init()) {
      return 0;
    }
    uint32_t capacity = ota_qspi_capacity();
    if (capacity < MOTA_MIN_LEN) {
      return 0;
    }
    g_qspi_total_size = capacity; // permits the initial bounded header/manifest reads
    if (!parse_mota_at(0, capacity, o)) {
      return 0;
    }
    g_qspi_total_size = o->total;
    return 1; // external container begins at offset zero
  }
  #endif
  if (stage_ceiling != MOTA_NRF52_STAGE_CEILING_LEGACY && stage_ceiling != MOTA_NRF52_STAGE_CEILING_EXPANDED
#if defined(MOTA_QSPI_BOOTLOADER_UPDATE)
      && stage_ceiling != MOTA_NRF52_BL_SCRATCH_START
#endif
  ) {
    return 0;
  }
  uint32_t top = (stage_ceiling - MOTA_MIN_LEN) & ~(PAGE - 1);
  for (uint32_t a = top + PAGE; a > APP_BASE;) { // walk page boundaries high -> low
    a -= PAGE;
    inherited_watchdog_feed();
    uint8_t m4[4];
    fl_read(a, m4, 4);
    if (memcmp(m4, MAGIC, 4) == 0 && parse_mota_at(a, stage_ceiling, o) &&
        ((stage_ceiling - o->total) & ~(PAGE - 1u)) == a) {
      return a;
    }
  }
  return 0;
#endif
}

// Locate the running image's EndF trailer (= body_len) by scanning bottom-up for the self-validating
// marker (mirrors the app's FirmwareInfo::find_self_firmware). We deliberately do NOT trust
// bootloader_settings.bank_0_size: the UF2 flasher does not set it to the exact EndF-inclusive image
// size, so trusting it makes a freshly UF2-flashed app fail the base check and silently refuse its first
// OTA update. Bottom-up returns the CURRENT (lowest) trailer; a stale one from a prior larger image sits
// above it and is never reached. No hash check is needed here: the caller immediately recomputes
// sha256(body) and compares it to the delta's base_hash, so a (vanishingly unlikely) coincidental "EndF"
// just fails that gate and the update is refused - never misapplied. Byte-by-byte (like the app) so no
// body_len alignment is assumed; the scan stops at the first match (the current image's trailer).
static int find_body_len(uint32_t app_limit, uint32_t *body_len_out) {
  if (app_limit <= APP_BASE) {
    return 0;
  }
  for (uint32_t off = 0; off + ENDF_LEN <= app_limit - APP_BASE; off++) {
    if ((off & (PAGE - 1u)) == 0) {
      inherited_watchdog_feed();
    }
    uint8_t e[8];
    fl_read(APP_BASE + off, e, 8); // marker(4) + body_len(4)
    if (memcmp(e, ENDF, 4) == 0 && rd_u32(e + 4) == off) {
      *body_len_out = off;
      return 1;
    }
  }
  return 0;
}

#if defined(MOTA_INTERNAL_BOOTLOADER_UPDATE) || defined(MOTA_SD_BOOTLOADER_UPDATE)
// An internal destination is safe only when the live application ends before
// it. Do not trust a marker-shaped byte sequence alone: bind the first EndF to
// the body by recomputing its truncated SHA-256 before any staged page is
// erased or rewritten.
bool ota_delta_live_app_fits_below(uint32_t limit) {
  uint32_t body_len;
  if (limit <= APP_BASE + ENDF_LEN || !find_body_len(limit, &body_len) || body_len == 0 ||
      body_len > limit - APP_BASE - ENDF_LEN) {
    return 0;
  }
  uint8_t expected[8];
  uint8_t actual[32];
  fl_read(APP_BASE + body_len + 8u, expected, sizeof(expected));
  sha256_region(APP_BASE, body_len, actual);
  if (memcmp(actual, expected, sizeof(expected)) != 0) {
    return 0;
  }

