mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/src/ota_delta.c
static int installed_boot_info(bootloader_image_info_t *info) {
#ifdef OTA_DELTA_HOST_TEST
  return otah_installed_boot_info(info);
#else
  extern const bootloader_update_envelope_t bootloaderUpdateManifest;
  const bootloader_update_extension_t *ext = &bootloaderUpdateManifest.extension;
  if (!bootloader_extension_validate(ext)) {
    return 0;
  }
  info->boot_version = ext->boot_version;
  info->softdevice_family = ext->softdevice_family;
  info->softdevice_fwid = ext->softdevice_fwid;
  info->app_base = ext->app_base;
  info->layout_abi = ext->layout_abi;
  return 1;
#endif
}

static uint16_t runtime_softdevice_fwid(void) {
#ifdef OTA_DELTA_HOST_TEST
  return otah_runtime_softdevice_fwid();
#else
  return mota_runtime_softdevice_fwid_get();
#endif
}

static int boot_image_metadata_valid_at(uint32_t address,
                                        const struct mota_min *m) {
  const uint8_t *image = boot_image_pointer(address);
  bootloader_image_info_t candidate;
  bootloader_image_info_t installed;
#ifdef OTA_DELTA_HOST_TEST
  static const char expected_device_name[BOOTLOADER_UPDATE_DEVICE_NAME_SIZE] = DEVICE_NAME;
#else
  extern const bootloader_update_envelope_t bootloaderUpdateManifest;
  const char *expected_device_name = bootloaderUpdateManifest.manifest.device_name;
#endif
  if (!image || !m ||
      !bootloader_image_info(image, MOTA_NRF52_BL_START, MOTA_NRF52_BL_SIZE,
                             BOOT_UPDATE_BOARD_ID, expected_device_name, &candidate) ||
      !boot_image_caps_valid(image) || !installed_boot_info(&installed)) {
    return 0;
  }
  // Remote bootloader replacement cannot migrate the SoftDevice/application
  // layout. The outer signed package version must describe the bytes
  // themselves, but its order is deliberately unrestricted so an operator can
  // install or restore any compatible signed release.
  return candidate.softdevice_family == installed.softdevice_family &&
         candidate.softdevice_fwid == installed.softdevice_fwid &&
         candidate.app_base == installed.app_base &&
         candidate.layout_abi == installed.layout_abi &&
         candidate.softdevice_family == MOTA_SOFTDEVICE_FAMILY &&
         candidate.softdevice_fwid == runtime_softdevice_fwid() &&
         candidate.app_base == APP_BASE &&
         candidate.layout_abi == BOOTLOADER_UPDATE_LAYOUT_ABI &&
         candidate.boot_version == m->fw_version;
}

static int copy_bootloader_to_raw_source(const struct mota_min *m) {
  uint8_t readback[256];
  for (uint32_t off = 0; off < MOTA_NRF52_BL_SIZE; off += PAGE) {
    inherited_watchdog_feed();
    // Internal staging deliberately overlaps the destination. The payload is
    // BOOT_UPDATE_PAYLOAD_OFFSET bytes ahead (365 for the exact v3 profile).
    // Read the complete source page into RAM before erasing the lower
    // destination page; all future source bytes are above that page.
    if (!staged_read(m->payload_addr + off, g_cache, PAGE)) {
      return 0;
    }
    fl_erase(BOOT_UPDATE_RAW_START + off);
    inherited_watchdog_feed();
    fl_write_words(BOOT_UPDATE_RAW_START + off, (const uint32_t *)g_cache, PAGE / 4u);
    for (uint32_t page_off = 0; page_off < PAGE; page_off += sizeof(readback)) {
      inherited_watchdog_feed();
      fl_read(BOOT_UPDATE_RAW_START + off + page_off, readback, sizeof(readback));
      if (memcmp(readback, g_cache + page_off, sizeof(readback)) != 0) {
        return 0;
      }
    }
  }

  uint8_t hash[32];
  sha256_region(BOOT_UPDATE_RAW_START, MOTA_NRF52_BL_SIZE, hash);
  return memcmp(hash, m->image_hash, sizeof(hash)) == 0;
}

static int mbr_copy_bootloader(void) {
#ifdef OTA_DELTA_HOST_TEST
  return otah_mbr_copy_bl(BOOT_UPDATE_RAW_START, MOTA_NRF52_BL_SIZE / 4u);
#else
  sd_mbr_command_t command = {
    .command = SD_MBR_COMMAND_COPY_BL,
    .params.copy_bl.bl_src = (uint32_t *)BOOT_UPDATE_RAW_START,
    .params.copy_bl.bl_len = MOTA_NRF52_BL_SIZE / 4u,
  };
  (void)sd_mbr_command(&command); // success does not return
  return 0;
#endif
}

static bool boot_update_reject(const struct mota_min *m, uint32_t result) {
  gpregret2_set(result);
  if (m && m->approved && !clear_approval(m)) {
    gpregret2_set(GPREGRET2_BL_APPROVAL);
  }
  return finish_apply(false);
}

static uint32_t scan_bootloader_mota(struct mota_min *m, uint32_t source) {
#if defined(MOTA_SD_BOOTLOADER_UPDATE)
  if (source != GPREGRET2_OTA_STAGE_SD) {
    return 0;
  }
  return scan_mota(m, APP_APPLY_END);
#elif defined(MOTA_QSPI_BOOTLOADER_UPDATE)
  if (source != GPREGRET2_OTA_STAGE_QSPI) {
    return 0;
  }
  g_qspi_source = 1;
  return scan_mota(m, APP_APPLY_END);
#else
  if (source != GPREGRET2_OTA_STAGE_EXPANDED) {
    return 0;
  }
  const uint32_t address = scan_mota(m, MOTA_NRF52_INTERNAL_BL_SLOT_END);
  return address == MOTA_NRF52_INTERNAL_BL_SLOT_START ? address : 0;
#endif
}

static bool apply_bootloader_update(void) {
  const uint32_t source = gpregret2_get();
  gpregret_set(0); // consume first: every validation/copy failure is fail-closed
  gpregret2_set(GPREGRET2_BL_GATE);
#if defined(MOTA_SD_BOOTLOADER_UPDATE)
  const int sd_authorized =
    sd_auth_take(MOTA_SD_AUTH_PURPOSE_BOOTLOADER, 3u);
  if (source != GPREGRET2_OTA_STAGE_SD) {
    gpregret2_set(GPREGRET2_BL_CONTAINER);
    return finish_apply(false);
  }
  if (!sd_authorized) {
    gpregret2_set(GPREGRET2_BL_APPROVAL);
    return finish_apply(false);
  }
#endif
  struct mota_min m;
  if (!scan_bootloader_mota(&m, source) || !m.approved) {
    gpregret2_set(GPREGRET2_BL_CONTAINER);
    return finish_apply(false);
  }
#if defined(MOTA_SD_BOOTLOADER_UPDATE)
  if (!sd_authorized_container_valid()) {
    return boot_update_reject(&m, GPREGRET2_BL_APPROVAL);
  }
#endif
  if (!boot_update_policy_valid(&m)) {
    return boot_update_reject(&m, GPREGRET2_BL_POLICY);
  }
  if (!staged_vectors_valid(m.payload_addr) || !boot_payload_integrity_valid(&m)) {
    return boot_update_reject(&m, GPREGRET2_BL_INTEGRITY);
  }
#if defined(MOTA_INTERNAL_BOOTLOADER_UPDATE)
  // Validate both sides of the safety boundary while the exact staged package
  // is still intact. Neither check relies on the application's approval.
  if (!ota_delta_live_app_fits_below(MOTA_NRF52_INTERNAL_BL_SLOT_START)) {
    return boot_update_reject(&m, GPREGRET2_BL_POLICY);
  }
  if (!boot_image_metadata_valid_at(m.payload_addr, &m)) {
    return boot_update_reject(&m, GPREGRET2_BL_MANIFEST);
  }
#elif defined(MOTA_SD_BOOTLOADER_UPDATE)
  // SD-backed application builds do not reserve the fixed MBR scratch range
  // at link time. Prove the live EndF-inclusive image ends below 0xE0000
  // before erasing any scratch page.
  if (!ota_delta_live_app_fits_below(MOTA_NRF52_BL_SCRATCH_START)) {
    return boot_update_reject(&m, GPREGRET2_BL_POLICY);
  }
  // APRV is removable-media metadata. Bind the candidate bytes to the signed
  // manifest image_hash captured by the app in internal scratch before the
  // first erase. Copying page zero consumes the token.
  if (!sd_boot_authorization_valid(&m)) {
    return boot_update_reject(&m, GPREGRET2_BL_APPROVAL);
  }
#endif
  if (!clear_approval(&m)) {
    gpregret2_set(GPREGRET2_BL_APPROVAL);
    return finish_apply(false);
  }
  if (!copy_bootloader_to_raw_source(&m)) {
    gpregret2_set(GPREGRET2_BL_COPY);
    return finish_apply(false);
  }
  // Revalidate the exact embedded board manifest/CRC and continuity capability
  // from the final raw MBR source. A reset before the MBR call boots the
  // unchanged application and old bootloader.
  if (!boot_image_metadata_valid_at(BOOT_UPDATE_RAW_START, &m)) {
    gpregret2_set(GPREGRET2_BL_MANIFEST);
    return finish_apply(false);
  }

  // External staging is no longer needed after the scratch copy. Release the
  // SD/QSPI peripheral before handing control to the MBR.
#if defined(MOTA_SD_BOOTLOADER_UPDATE)
  ota_sd_deinit();
#elif defined(MOTA_QSPI_BOOTLOADER_UPDATE)
  ota_qspi_deinit();
  g_qspi_source = 0;
#endif
  gpregret2_set(GPREGRET2_BL_MBR_HANDOFF);
  if (mbr_copy_bootloader()) {
    return true; // host-only success model; hardware success never returns
  }
  gpregret2_set(GPREGRET2_BL_MBR_RETURNED);
  return false;
}
#endif // MOTA_BOOTLOADER_UPDATE_ENABLED

